app/views/posts/index.html.erb

SELECT COUNT(*) FROM "votes" WHERE "votes"."post_id" = $1  [["post_id", 2]]
---
  <td><%= button_to '+1', upvote_post_path(post), method: :post %></td>
  <td><%= pluralize(post.votes.count, "vote") %></td>