app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "link", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "this is a new link"], ["link", "http://www.span20.com"], ["user_id", 1], ["created_at", "2016-01-06 04:15:51.278477"], ["updated_at", "2016-01-06 04:15:51.278477"]]
---
  def create
    post = Post.create post_params do |p|